Revit 2026 API

# ScheduleFieldParameterId Property

---

The ID of the parameter displayed by the field.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId ParameterId { get; }
```
```vb
Public ReadOnly Property ParameterId As ElementId
	Get
```
```cpp
public:
property ElementId^ ParameterId {
	ElementId^ get ();
}
```
```fsharp
member ParameterId : ElementId with get
```

#### Property Value

ElementId

Most field types require a parameter ID. Count, Formula, and Percentage fields don't have parameter IDs.

#### Reference

ScheduleField Class

Autodesk.Revit.DB Namespace